src/main/resources/templates/soap-env-add.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:tem="http://tempuri.org/">
   <soap:Header/>
   <soap:Body>
      <tem:Add>
         <tem:intA>{headers.num1}</tem:intA>
         <tem:intB>{headers.num2}</tem:intB>
      </tem:Add>
   </soap:Body>
</soap:Envelope>