dist/module/hotel/soapXML/add.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/">
    <soapenv:Header/>
    <soapenv:Body>
        <tem:Add>
            <tem:intA>--V1--</tem:intA>
            <tem:intB>--V2--</tem:intB>
        </tem:Add>
    </soapenv:Body>
</soapenv:Envelope>

<!-- <HotelBedding Type="RollawayAdult" />
    <HotelBedding Type="Crib" />
    <NumberOfChildren Count="2">
      <Age>2</Age>
      <Age>4</Age>
    </NumberOfChildren> -->