tests/fixtures/calculator/AddRQ.xml

<?xml version='1.0' encoding='UTF-8'?>
<soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://tempuri.org/">
  <soap-env:Body>
    <ns1:Add>
      <ns1:intA>1</ns1:intA>
      <ns1:intB>3</ns1:intB>
    </ns1:Add>
  </soap-env:Body>
</soap-env:Envelope>
